jankaluza/qsimkit/CPU/Variants/msp430x33x.cpp
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef URXSE
#define URXSE 0x08
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef P0OUT_0
#define P0OUT_0 0x01
#endif
#ifndef P0OUT_1
#define P0OUT_1 0x02
#endif
#ifndef P0OUT_2
#define P0OUT_2 0x04
#endif
#ifndef P0OUT_3
#define P0OUT_3 0x08
#endif
#ifndef P0OUT_4
#define P0OUT_4 0x10
#endif
#ifndef P0OUT_5
#define P0OUT_5 0x20
#endif
#ifndef P0OUT_6
#define P0OUT_6 0x40
#endif
#ifndef EN1FG
#define EN1FG 0x01
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef PENA
#define PENA 0x80
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef CKPH
#define CKPH 0x80
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef CKPL
#define CKPL 0x40
#endif
#ifndef U0IE
#define U0IE IE1
#endif
#ifndef P0IFG_2
#define P0IFG_2 0x04
#endif
#ifndef P0IFG_3
#define P0IFG_3 0x08
#endif
#ifndef P0IFG_4
#define P0IFG_4 0x10
#endif
#ifndef P0IFG_5
#define P0IFG_5 0x20
#endif
#ifndef P0IFG_6
#define P0IFG_6 0x40
#endif
#ifndef P0IFG_7
#define P0IFG_7 0x80
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef TPCNT1_EN_nTPIN5
#define TPCNT1_EN_nTPIN5 ENB
#endif
#ifndef URCTL_
#define URCTL_ 0x0072
#endif
#ifndef __MSP430_HAS_TA5__
#define __MSP430_HAS_TA5__ 
#endif
#ifndef TCCTL_
#define TCCTL_ 0x0042
#endif
#ifndef __MSP430_HAS_PORT3__
#define __MSP430_HAS_PORT3__ 
#endif
#ifndef TXBUF_0_
#define TXBUF_0_ 0x0077
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef __MSP430_HAS_BT__
#define __MSP430_HAS_BT__ 
#endif
#ifndef __HAVE_BUILTIN_SETJMP__
#define __HAVE_BUILTIN_SETJMP__ 1
#endif
#ifndef __msp430_have_port1
#define __msp430_have_port1 
#endif
#ifndef __msp430_have_port2
#define __msp430_have_port2 
#endif
#ifndef BTCTL_
#define BTCTL_ 0x0040
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef __msp430x33x
#define __msp430x33x 
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef __msp430_have_port4
#define __msp430_have_port4 
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef LCDM10_
#define LCDM10_ LCD_BASE+0xA
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef CBSEL0
#define CBSEL0 0x02
#endif
#ifndef CBSEL1
#define CBSEL1 0x04
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef LCDM11_
#define LCDM11_ LCD_BASE+0xB
#endif
#ifndef P0IE_
#define P0IE_ 0x0015
#endif
#ifndef SCFQ_256K
#define SCFQ_256K 0x07
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef LCDM13_
#define LCDM13_ LCD_BASE+0xD
#endif
#ifndef TPSSEL_CLK1_MCLK
#define TPSSEL_CLK1_MCLK TPSSEL1
#endif
#ifndef LCDM14_
#define LCDM14_ LCD_BASE+0xE
#endif
#ifndef LCDM15_
#define LCDM15_ LCD_BASE+0xF
#endif
#ifndef LCDLOWR
#define LCDLOWR 0x02
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef P0IE_5
#define P0IE_5 0x20
#endif
#ifndef __MSP430_HAS_EPROM__
#define __MSP430_HAS_EPROM__ 
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef TPCTL_
#define TPCTL_ 0x004B
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef UTCTL0_
#define UTCTL0_ 0x0071
#endif
#ifndef LCDM1_
#define LCDM1_ LCDMEM_
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
#ifndef TXEPT
#define TXEPT 0x01
#endif
#ifndef BTDIV
#define BTDIV 0x20
#endif
#ifndef LCDM2_
#define LCDM2_ LCD_BASE+0x2
#endif
#ifndef UBR0_0_
#define UBR0_0_ 0x0074
#endif
#ifndef BT_fLCD_DIV32
#define BT_fLCD_DIV32 0
#endif
#ifndef SSEL_SMCLK
#define SSEL_SMCLK SSEL_2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LCDM3_
#define LCDM3_ LCD_BASE+0x3
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef TCRXD
#define TCRXD 0x01
#endif
#ifndef P0IES_
#define P0IES_ 0x0014
#endif
#ifndef LCDM4_
#define LCDM4_ LCD_BASE+0x4
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
#ifndef P0IN_
#define P0IN_ 0x0010
#endif
#ifndef __msp430_headers_eprom_h
#define __msp430_headers_eprom_h 
#endif
#ifndef U0TXBUF_
#define U0TXBUF_ 0x0077
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef LCDM5_
#define LCDM5_ LCD_BASE+0x5
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef LCDM6_
#define LCDM6_ LCD_BASE+0x6
#endif
#ifndef P0IN_0
#define P0IN_0 0x01
#endif
#ifndef P0IN_1
#define P0IN_1 0x02
#endif
#ifndef P0IN_2
#define P0IN_2 0x04
#endif
#ifndef P0IN_3
#define P0IN_3 0x08
#endif
#ifndef P0IN_4
#define P0IN_4 0x10
#endif
#ifndef P0IN_5
#define P0IN_5 0x20
#endif
#ifndef P0IN_6
#define P0IN_6 0x40
#endif
#ifndef P0IN_7
#define P0IN_7 0x80
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef LCDM7_
#define LCDM7_ LCD_BASE+0x7
#endif
#ifndef P0DIR_6
#define P0DIR_6 0x40
#endif
#ifndef TCSSEL0
#define TCSSEL0 0x40
#endif
#ifndef TCSSEL1
#define TCSSEL1 0x80
#endif
#ifndef LCDM8_
#define LCDM8_ LCD_BASE+0x8
#endif
#ifndef LCDM9_
#define LCDM9_ LCD_BASE+0x9
#endif
#ifndef P0OUT_7
#define P0OUT_7 0x80
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef P0OUT_
#define P0OUT_ 0x0011
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef LCD_BASE
#define LCD_BASE 0x30
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef BT_fCLK2_DIV2
#define BT_fCLK2_DIV2 0
#endif
#ifndef CHAR
#define CHAR 0x10
#endif
#ifndef SPB
#define SPB 0x20
#endif
#ifndef P0IE_2
#define P0IE_2 0x04
#endif
#ifndef P0IE_3
#define P0IE_3 0x08
#endif
#ifndef P0IE_4
#define P0IE_4 0x10
#endif
#ifndef P0IE_6
#define P0IE_6 0x40
#endif
#ifndef P0IE_7
#define P0IE_7 0x80
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef TCTXD
#define TCTXD 0x02
#endif
#ifndef TCTXE
#define TCTXE 0x10
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TPCNT1_
#define TPCNT1_ 0x004C
#endif
#ifndef LCDMA_
#define LCDMA_ LCDM10_
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef BASICTIMER_VECTOR
#define BASICTIMER_VECTOR 2
#endif
#ifndef LCDMEM_
#define LCDMEM_ LCD_BASE+1
#endif
#ifndef LCDMB_
#define LCDMB_ LCDM11_
#endif
#ifndef RXERR
#define RXERR 0x01
#endif
#ifndef STC
#define STC 0x02
#endif
#ifndef LCDMC_
#define LCDMC_ LCDM12_
#endif
#ifndef LCDMD_
#define LCDMD_ LCDM13_
#endif
#ifndef CBSEL_ACLK
#define CBSEL_ACLK 0
#endif
#ifndef TPSSEL_CLK2_MCLK
#define TPSSEL_CLK2_MCLK TPSSEL3
#endif
#ifndef LCDMEM
#define LCDMEM LCDMEM_
#endif
#ifndef TCDAT
#define TCDAT 0x0044
#endif
#ifndef LCDME_
#define LCDME_ LCDM14_
#endif
#ifndef BT_fCLK2_MCLK
#define BT_fCLK2_MCLK BTSSEL
#endif
#ifndef LCDM12_
#define LCDM12_ LCD_BASE+0xC
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef __MSP430_HAS_8BTC__
#define __MSP430_HAS_8BTC__ 
#endif
#ifndef LCDMF_
#define LCDMF_ LCDM15_
#endif
#ifndef UTCTL_0_
#define UTCTL_0_ 0x0071
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 16
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef TPE_4
#define TPE_4 0x10
#endif
#ifndef LCDCTL_
#define LCDCTL_ LCD_BASE
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef URCTL_0_
#define URCTL_0_ 0x0072
#endif
#ifndef RXBUF_
#define RXBUF_ 0x0076
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef U0IFG
#define U0IFG IFG1
#endif
#ifndef __msp430_headers_timerport_h
#define __msp430_headers_timerport_h 
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef CBE
#define CBE 0x01
#endif
#ifndef TPE_0
#define TPE_0 0x01
#endif
#ifndef TPE_1
#define TPE_1 0x02
#endif
#ifndef TPE_2
#define TPE_2 0x04
#endif
#ifndef TPE_3
#define TPE_3 0x08
#endif
#ifndef TPE_5
#define TPE_5 0x20
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __MSP430_HAS_PORT0__
#define __MSP430_HAS_PORT0__ 
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef UARTTX_VECTOR
#define UARTTX_VECTOR 12
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef IO1_VECTOR
#define IO1_VECTOR 24
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef UARTRX_VECTOR
#define UARTRX_VECTOR 14
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef SCFQ_1M
#define SCFQ_1M 0x1F
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef BTIP1
#define BTIP1 0x02
#endif
#ifndef RXWAKE
#define RXWAKE 0x02
#endif
#ifndef U0RCTL_
#define U0RCTL_ 0x0072
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef P0DIR_4
#define P0DIR_4 0x10
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __msp430_headers_system_clock_h
#define __msp430_headers_system_clock_h 
#endif
#ifndef LCDMX0
#define LCDMX0 0x08
#endif
#ifndef LCDMX1
#define LCDMX1 0x10
#endif
#ifndef UMCTL_0_
#define UMCTL_0_ 0x0073
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef TPD_0
#define TPD_0 0x01
#endif
#ifndef U0ME
#define U0ME ME1
#endif
#ifndef LCDOG1_7
#define LCDOG1_7 0x00
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef PORT0_VECTOR
#define PORT0_VECTOR 0
#endif
#ifndef __MSP430_HAS_PORT2__
#define __MSP430_HAS_PORT2__ 
#endif
#ifndef TPCNT2_
#define TPCNT2_ 0x004D
#endif
#ifndef __MSP430_HAS_MPY__
#define __MSP430_HAS_MPY__ 
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef MACS_
#define MACS_ 0x0136
#endif
#ifndef TXBUF0_
#define TXBUF0_ 0x0077
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SSEL0
#define SSEL0 0x10
#endif
#ifndef SSEL1
#define SSEL1 0x20
#endif
#ifndef EPEXE
#define EPEXE 0x01
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef PEV
#define PEV 0x40
#endif
#ifndef TCSSEL_P01
#define TCSSEL_P01 0
#endif
#ifndef TPSSEL_CLK1_ACLK
#define TPSSEL_CLK1_ACLK TPSSEL0
#endif
#ifndef __MSP430_HAS_FLL__
#define __MSP430_HAS_FLL__ 
#endif
#ifndef RXBUF0_
#define RXBUF0_ 0x0076
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __GNUC__
#define __GNUC__ 3
#endif
#ifndef SWRST
#define SWRST 0x01
#endif
#ifndef EN1
#define EN1 0x08
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 6
#endif
#ifndef ENA
#define ENA 0x10
#endif
#ifndef ENB
#define ENB 0x20
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef TPCNT1_EN_OFF
#define TPCNT1_EN_OFF 0
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ 0x0134
#endif
#ifndef __MSP430_HAS_UART0__
#define __MSP430_HAS_UART0__ 
#endif
#ifndef RC1FG
#define RC1FG 0x02
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef __MSP430_HAS_PORT4__
#define __MSP430_HAS_PORT4__ 
#endif
#ifndef LCDON
#define LCDON 0x01
#endif
#ifndef LCDP0
#define LCDP0 0x20
#endif
#ifndef LCDP1
#define LCDP1 0x40
#endif
#ifndef LCDP2
#define LCDP2 0x80
#endif
#ifndef TCENCNT
#define TCENCNT 0x08
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef TIMERPORT_VECTOR
#define TIMERPORT_VECTOR 8
#endif
#ifndef LCDSG0
#define LCDSG0 0x00
#endif
#ifndef FE
#define FE 0x80
#endif
#ifndef P0IFG_
#define P0IFG_ 0x0013
#endif
#ifndef BT_ADLY_0_064
#define BT_ADLY_0_064 0
#endif
#ifndef BTRESET
#define BTRESET 0x40
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef BTCNT1_
#define BTCNT1_ 0x0046
#endif
#ifndef TCISCTL
#define TCISCTL 0x20
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef BTFRFQ0
#define BTFRFQ0 0x08
#endif
#ifndef BTFRFQ1
#define BTFRFQ1 0x10
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef EPVPPS
#define EPVPPS 0x02
#endif
#ifndef BTCNT2_
#define BTCNT2_ 0x0047
#endif
#ifndef __msp430_headers_timer8_h
#define __msp430_headers_timer8_h 
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef SSEL_UCLKI
#define SSEL_UCLKI SSEL_0
#endif
#ifndef URXWIE
#define URXWIE 0x04
#endif
#ifndef TCRXACT
#define TCRXACT 0x04
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef MSP430_NO_HW_MUL
#define MSP430_NO_HW_MUL 1
#endif
#ifndef BT_fLCD_1K
#define BT_fLCD_1K 0
#endif
#ifndef MM
#define MM 0x02
#endif
#ifndef LCDSON
#define LCDSON 0x04
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef UBR10_
#define UBR10_ 0x0075
#endif
#ifndef B16
#define B16 0x80
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef OE
#define OE 0x20
#endif
#ifndef SSEL_0
#define SSEL_0 0x00
#endif
#ifndef SSEL_1
#define SSEL_1 0x10
#endif
#ifndef SSEL_2
#define SSEL_2 0x20
#endif
#ifndef SSEL_3
#define SSEL_3 0x30
#endif
#ifndef PE
#define PE 0x40
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef RXBUF_0_
#define RXBUF_0_ 0x0076
#endif
#ifndef TPSSEL0
#define TPSSEL0 0x40
#endif
#ifndef TPSSEL1
#define TPSSEL1 0x80
#endif
#ifndef TPSSEL2
#define TPSSEL2 0x40
#endif
#ifndef TPSSEL3
#define TPSSEL3 0x80
#endif
#ifndef __MSP430_HAS_TP__
#define __MSP430_HAS_TP__ 
#endif
#ifndef BT_fCLK2_ACLK_DIV256
#define BT_fCLK2_ACLK_DIV256 BTDIV
#endif
#ifndef TPSSEL_CLK2_TPIN5
#define TPSSEL_CLK2_TPIN5 0
#endif
#ifndef __msp430_headers_basic_timer_h
#define __msp430_headers_basic_timer_h 
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef SCFQ_2M
#define SCFQ_2M 0x3F
#endif
#ifndef SCFI0_
#define SCFI0_ 0x0050
#endif
#ifndef TPSSEL_CLK2_ACLK
#define TPSSEL_CLK2_ACLK TPSSEL2
#endif
#ifndef SCFI1_
#define SCFI1_ 0x0051
#endif
#ifndef BT_fCLK2_ACLK
#define BT_fCLK2_ACLK 0x00
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef SCFQ_4M
#define SCFQ_4M 0x7F
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef CPON
#define CPON 0x40
#endif
#ifndef TPSSEL_CLK1_CIN
#define TPSSEL_CLK1_CIN 0
#endif
#ifndef SCFQ_128K
#define SCFQ_128K 0x03
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef __msp430_headers_lcd_h
#define __msp430_headers_lcd_h 
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef IO0_VECTOR
#define IO0_VECTOR 26
#endif
#ifndef RC2FG
#define RC2FG 0x04
#endif
#ifndef P0DIR_
#define P0DIR_ 0x0012
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef SCFQ_512K
#define SCFQ_512K 0x0F
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 102
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef TPD_
#define TPD_ 0x004E
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef TPE_
#define TPE_ 0x004F
#endif
#ifndef __msp430_have_port3
#define __msp430_have_port3 
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 2
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef TPD_1
#define TPD_1 0x02
#endif
#ifndef TPD_2
#define TPD_2 0x04
#endif
#ifndef TPD_3
#define TPD_3 0x08
#endif
#ifndef TPD_4
#define TPD_4 0x10
#endif
#ifndef TPD_5
#define TPD_5 0x20
#endif
#ifndef ME2_
#define ME2_ 0x0005
#endif
#ifndef __MSP430_HAS_LCD__
#define __MSP430_HAS_LCD__ 
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ int
#endif
#ifndef UBR1_0_
#define UBR1_0_ 0x0075
#endif
#ifndef SCFQCTL_
#define SCFQCTL_ 0x0052
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef BTSSEL
#define BTSSEL 0x80
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef P0IES_0
#define P0IES_0 0x01
#endif
#ifndef P0IES_1
#define P0IES_1 0x02
#endif
#ifndef P0IES_2
#define P0IES_2 0x04
#endif
#ifndef P0IES_3
#define P0IES_3 0x08
#endif
#ifndef P0IES_4
#define P0IES_4 0x10
#endif
#ifndef P0IES_5
#define P0IES_5 0x20
#endif
#ifndef P0IES_6
#define P0IES_6 0x40
#endif
#ifndef P0IES_7
#define P0IES_7 0x80
#endif
#ifndef BTHOLD
#define BTHOLD 0x40
#endif
#ifndef CBCTL_
#define CBCTL_ 0x0053
#endif
#ifndef __msp430_headers_usart_h
#define __msp430_headers_usart_h 
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 18
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef FN_2
#define FN_2 0x04
#endif
#ifndef FN_3
#define FN_3 0x08
#endif
#ifndef FN_4
#define FN_4 0x10
#endif
#ifndef P0DIR_0
#define P0DIR_0 0x01
#endif
#ifndef P0DIR_1
#define P0DIR_1 0x02
#endif
#ifndef P0DIR_2
#define P0DIR_2 0x04
#endif
#ifndef P0DIR_3
#define P0DIR_3 0x08
#endif
#ifndef __msp430_have_lcdlowr
#define __msp430_have_lcdlowr 
#endif
#ifndef P0DIR_5
#define P0DIR_5 0x20
#endif
#ifndef P0DIR_7
#define P0DIR_7 0x80
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef EPCTL_
#define EPCTL_ 0x0054
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 4
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef BTIP0
#define BTIP0 0x01
#endif
#ifndef BTIP2
#define BTIP2 0x04
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef TPCNT1_EN_ON
#define TPCNT1_EN_ON ENA
#endif
#ifndef TCPLD
#define TCPLD 0x0043
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef __VERSION__
#define __VERSION__ "3.2.3"
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x33x : public Variant {
	public:
		Variant_msp430x33x() {}
		virtual ~Variant_msp430x33x() {}
		const char *getName() { return "msp430x33x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


